def x_new(x_0):
    x_1 = x_0 - ((12 * x_0 ** 4 + 11 * x_0 ** 3 - 10 * x_0 ** 2 - 999) / (48 * x_0 ** 3 + 33 * x_0 ** 2 - 20 * x_0))
    return x_1


def x_new_2(x_0_2):
    x_1_2 = x_0_2 - ((12 * x_0_2 ** 4 + 11 * x_0_2 ** 3 - 10 * x_0_2 ** 2 - 999) / (
                48 * x_0_2 ** 3 + 33 * x_0_2 ** 2 - 20 * x_0_2))
    return x_1_2


x_0 = 3
E = 0.000001
x_0_2 = -3.5
B = abs(1 / (48 * x_0 ** 3 + 33 * x_0 ** 2 - 20 * x_0))
n = abs((12 * x_0 ** 4 + 11 * x_0 ** 3 - 10 * x_0 ** 2 - 999) / (48 * x_0 ** 3 + 33 * x_0 ** 2 - 20 * x_0))
K = abs(2 * (72 * x_0 ** 2 + 33 * x_0 - 10))
if (B * n * K) <= 0.5:
    print("Проверка сходимости теоремы Конторовича сошлась.")
else:
    print("Проверка сходимости теоремы Конторовича не сошлась, перепроверить.")
while abs(x_new(x_0) - x_0) >= E:
    x_0 = x_new(x_0)
print("Один из корней уравнения равен: " + str(x_0))


while abs(x_new_2(x_0_2) - x_0_2) >= E:
    x_0_2 = x_new_2(x_0_2)
print("Второй корень уравнения равен: " + str(x_0_2))
print(str(12 * x_0 ** 4 + 11 * x_0 ** 3 - 10 * x_0 ** 2 - 999) + " = 0")
print(str(12 * x_0_2 ** 4 + 11 * x_0_2 ** 3 - 10 * x_0_2 ** 2 - 999) + " = 0")